In [2]:
import pandas as pd
import numpy as np

In [3]:
prof = pd.read_csv('./data/Prestige.csv')
prof.head()

                  name  education  income  women  prestige  census  type
0   gov.administrators      13.11   12351  11.16      68.8    1113  prof
1     general.managers      12.26   25879   4.02      69.1    1130  prof
2          accountants      12.77    9271  15.70      63.4    1171  prof
3  purchasing.officers      11.42    8865   9.11      56.8    1175  prof
4             chemists      14.62    8403  11.68      73.5    2111  prof

In [8]:
dct = {'name':'data scientist',
        'education': np.NaN,
        'income': np.NaN,
        'women': np.NaN,
        'prestige': np.NaN,
        'census': np.NaN,
        'type': np.NaN}
dct

{'name': 'data scientist',
 'education': nan,
 'income': nan,
 'women': nan,
 'prestige': nan,
 'census': nan,
 'type': nan}

In [13]:
prof = prof.append(dct, ignore_index=True)

In [15]:
prof.tail()

               name  education  income  women  prestige  census type
98     taxi.drivers       7.93  4224.0   3.59      25.1  9173.0   bc
99     longshoremen       8.37  4753.0   0.00      26.1  9313.0   bc
100     typesetters      10.00  6462.0  13.58      42.2  9511.0   bc
101     bookbinders       8.55  3617.0  70.87      35.2  9517.0   bc
102  data scientist        NaN     NaN    NaN       NaN     NaN  NaN

In [22]:
taxi = prof.where(prof['name']=='taxi.drivers').dropna()
taxi

            name  education  income  women  prestige  census type
98  taxi.drivers       7.93  4224.0   3.59      25.1  9173.0   bc

In [25]:
prof = prof.drop(98)
prof.tail()

In [27]:
prof = prof.append(taxi)
prof.tail()

In [30]:
prof = prof.drop(columns='census')

In [31]:
del prof['type']

In [32]:
prof

                    name  education   income  women  prestige
0     gov.administrators      13.11  12351.0  11.16      68.8
1       general.managers      12.26  25879.0   4.02      69.1
2            accountants      12.77   9271.0  15.70      63.4
3    purchasing.officers      11.42   8865.0   9.11      56.8
4               chemists      14.62   8403.0  11.68      73.5
..                   ...        ...      ...    ...       ...
99          longshoremen       8.37   4753.0   0.00      26.1
100          typesetters      10.00   6462.0  13.58      42.2
101          bookbinders       8.55   3617.0  70.87      35.2
102       data scientist        NaN      NaN    NaN       NaN
98          taxi.drivers       7.93   4224.0   3.59      25.1

[103 rows x 5 columns]